Repository: Sukuna9977/patroller-SOS
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appTitle
source: SeaSOS
ar: سي إس أو إس

source: Missions
ar: المهام

source: Profile
ar: الملف الشخصي
fr: Profil

source: Settings
ar: الإعدادات
fr: Paramètres

source: Language
ar: اللغة
fr: Langue

source: Dark Mode
ar: الوضع المظلم
fr: Mode Sombre

source: Change Password
ar: تغيير كلمة المرور
fr: Changer le mot de passe

source: Log Out
ar: تسجيل الخروج
fr: Se Déconnecter

source: Search Missions
ar: البحث عن المهام
fr: Rechercher des missions

source: Details
ar: تفاصيل
fr: Détails

source: All
ar: الكل
fr: Tout

# low
source: Low (1-2)
ar: منخفض (1-2)
fr: Faible (1-2)

# medium
source: Medium (3)
ar: متوسط (3)
fr: Moyenne (3)

# high
source: High (4)
ar: مرتفع (4)
fr: Élevée (4)

# critical
source: Critical (5)
ar: حرج (5)
fr: Critique (5)

source: Mission Details
ar: تفاصيل المهمة
fr: Détails de la mission

source: Mission Type
ar: نوع المهمة
fr: Type de mission

source: Number of People
ar: عدد الأشخاص
fr: Nombre de personnes

source: Location
ar: الموقع
fr: Emplacement

source: Departure
ar: المغادرة
fr: Départ

# sizeOfBoat
source: Size of the boat
ar: حجم القارب
fr: Taille du bateau

source: Current Status
ar: الحالة الحالية
fr: Statut actuel

source: Urgency Level
ar: مستوى الطوارئ
fr: Niveau d'urgence

source: Reported On
ar: تم الإبلاغ في
fr: Signalé le

# requiresImmediateAttention
source: This mission requires immediate attention. Please review all details and prepare accordingly.
ar: تتطلب هذه المهمة اهتمامًا فوريًا. يرجى مراجعة جميع التفاصيل والاستعداد وفقًا لذلك.
fr: Cette mission nécessite une attention immédiate. Veuillez examiner tous les détails et vous préparer en conséquence.

source: Priority
ar: الأولوية
fr: Priorité

source: Start
ar: ابدأ
fr: Démarrer

source: Mark as Complete
ar: وضع علامة كمكتمل
fr: Marquer comme terminé

source: Enter your report
ar: أدخل تقريرك
fr: Entrez votre rapport

source: Submit
ar: إرسال
fr: Soumettre

source: Email
ar: البريد الإلكتروني

source: Rank
ar: الرتبة
fr: Rang

source: Team Members
ar: أعضاء الفريق
fr: Membres de l'équipe

source: Update Profile Picture
ar: تحديث صورة الملف الشخصي
fr: Mettre à jour la photo de profil

# immediateAttention
source: This mission requires immediate attention. Please review all details and prepare accordingly.
ar: تتطلب هذه المهمة اهتمامًا فوريًا. يرجى مراجعة جميع التفاصيل والاستعداد وفقًا لذلك.
fr: Cette mission nécessite une attention immédiate. Veuillez examiner tous les détails et vous préparer en conséquence.

source: Urgency
ar: الطوارئ
fr: Urgence

source: Large
ar: كبير
fr: Grand

source: Small
ar: صغير
fr: Petit

source: Man overboard
ar: رجل في البحر
fr: Homme à la mer

source: Flooding
ar: الفيضانات
fr: Inondation

source: Grounding
ar: الجنوح
fr: Échouement

source: Ship collision
ar: تصادم السفن
fr: Collision de navires

source: Machinery failure
ar: فشل الماكينة
fr: Défaillance de la machinerie

source: Piracy and armed attacks
ar: القرصنة والهجمات المسلحة
fr: Piratage et attaques armées

source: Medical emergency
ar: حالة طوارئ طبية
fr: Urgence médicale

source: Search and rescue
ar: البحث والإنقاذ
fr: Recherche et sauvetage

source: Adverse weather conditions
ar: الظروف الجوية السيئة
fr: Conditions météorologiques défavorables

source: Unconscious
ar: فاقد الوعي
fr: Inconscient

source: Critical condition
ar: حالة حرجة
fr: État critique

source: Injured
ar: مصاب
fr: Blessé

source: Difficulty breathing
ar: صعوبة في التنفس
fr: Difficulté à respirer

source: Severe bleeding
ar: نزيف حاد
fr: Saignement grave

source: Choking
ar: اختناق
fr: Étouffement

source: Cardiac arrest
ar: توقف القلب
fr: Arrêt cardiaque

source: Allergic reaction
ar: رد فعل تحسسي
fr: Réaction allergique

source: Overdose
ar: جرعة زائدة

source: La Goulette
ar: لا جوليت

# rads
source: Radès
ar: رادس

source: Sousse
ar: سوسة

source: Sfax
ar: صفاقس

# gabes
source: Gabès
ar: قابس

source: Zarzis
ar: جرجيس

# errorTokenNotFound
source: Token not found for Mission Dashboard
ar: لم يتم العثور على الرمز المميز لصفحة إدارة المهام
fr: Jeton non trouvé pour le tableau de bord des missions

source: Page not found
ar: الصفحة غير موجودة
fr: Page non trouvée

source: Error
ar: خطأ
fr: Erreur

source: No missions found
ar: لم يتم العثور على أي مهمات
fr: Aucune mission trouvée

source: Time
ar: الوقت
fr: Temps

source: Report
ar: التقرير
fr: Rapport

source: Mission Finished
ar: المهمة انتهت
fr: Mission terminée

source: Failed to load profile data
ar: فشل في تحميل بيانات الملف الشخصي
fr: Échec du chargement des données du profil

source: Error fetching profile data
ar: خطأ في جلب بيانات الملف الشخصي
fr: Erreur lors de la récupération des données du profil

source: Error selecting image from camera
ar: خطأ في اختيار الصورة من الكاميرا
fr: Erreur lors de la sélection de l'image de la caméra

source: Error selecting image from gallery
ar: خطأ في اختيار الصورة من المعرض
fr: Erreur lors de la sélection de l'image de la galerie

source: OK
ar: حسنًا

source: No team members
ar: لا يوجد أعضاء في الفريق
fr: Aucun membre de l'équipe
